app/controllers/book_controller.rb

  def index
    if params.has_key?(:seat_id)
      s = Seat.find_by id: params[:seat_id]
      if s.nil?
        render json: {success: false, message: 'Seat not found'}
      else
        if s.status == 'BOOKED'
          render json: {success: false, message: 'Seat already booked'}
        else
          s.status = 'BOOKED'
          s.save
---
SELECT "seats".* FROM "seats" WHERE "seats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "seats" SET "status" = ?, "updated_at" = ? WHERE "seats"."id" = ?  [["status", "BOOKED"], ["updated_at", "2019-10-30 14:52:01.181652"], ["id", 1]]